{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1493","layers":[{"class_name":"Dense","config":{"units":12,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4871","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"}},{"class_name":"Dense","config":{"units":12,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4872","trainable":true}},{"class_name":"Dense","config":{"units":12,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4873","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4874","trainable":true}}]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense4871/kernel","shape":[12,12],"dtype":"float32"},{"name":"dense_Dense4871/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense4872/kernel","shape":[12,12],"dtype":"float32"},{"name":"dense_Dense4872/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense4873/kernel","shape":[12,12],"dtype":"float32"},{"name":"dense_Dense4873/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense4874/kernel","shape":[12,1],"dtype":"float32"},{"name":"dense_Dense4874/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null}