{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_6618","layers":[{"class_name":"Dense","config":{"units":242,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22841","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"}},{"class_name":"Dense","config":{"units":242,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22842","trainable":true}},{"class_name":"Dense","config":{"units":242,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22843","trainable":true}},{"class_name":"Dense","config":{"units":242,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22844","trainable":true}},{"class_name":"Dense","config":{"units":242,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22845","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22846","trainable":true}}]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense22841/kernel","shape":[12,242],"dtype":"float32"},{"name":"dense_Dense22841/bias","shape":[242],"dtype":"float32"},{"name":"dense_Dense22842/kernel","shape":[242,242],"dtype":"float32"},{"name":"dense_Dense22842/bias","shape":[242],"dtype":"float32"},{"name":"dense_Dense22843/kernel","shape":[242,242],"dtype":"float32"},{"name":"dense_Dense22843/bias","shape":[242],"dtype":"float32"},{"name":"dense_Dense22844/kernel","shape":[242,242],"dtype":"float32"},{"name":"dense_Dense22844/bias","shape":[242],"dtype":"float32"},{"name":"dense_Dense22845/kernel","shape":[242,242],"dtype":"float32"},{"name":"dense_Dense22845/bias","shape":[242],"dtype":"float32"},{"name":"dense_Dense22846/kernel","shape":[242,1],"dtype":"float32"},{"name":"dense_Dense22846/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null}